Public Member Functions | List of all members
ACAPI::Library::LibraryManager::Modifier Class Referencefinal
Library Management
The Modifier object of the LibraryManager. More...
#include <LibraryManager.hpp>
 Inheritance diagram for ACAPI::Library::LibraryManager::Modifier:
 Public Member Functions
Result< void >  | AddLibrary (const IO::Location &libraryPath)
Add a libary to the actual library list.
Result< void >  | AddLibrary (const GS::UniString &twServerURL, const GS::UniString &twServerPath)
Add a server libary to the actual library list.
Result< void >  | RemoveLibrary (const Library &library)
Remove a libary from the actual library list. Embedded and Built-In libraries cannot be removed.
Detailed Description
The Modifier object of the LibraryManager.
Since
Archicad 28